app/controllers/tasks_controller.rb

  def index
    @tasks = Task.all
    if  params[:todo_id]
      @tasks = Task.where(todo_id:params[:todo_id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."todo_id" = ?  [["todo_id", 1]]