app/controllers/todos_controller.rb

  def show

    if params[:id]
      @todo=Todo.find(params[:id])
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT 1  [["id", 1]]

  def create

    @todo = Todo.new(todo_params)

    if @todo.save
---
INSERT INTO "todos" ("name", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "new task"], ["date", "0002-04-17"], ["created_at", "2017-04-22 13:28:59.390050"], ["updated_at", "2017-04-22 13:28:59.390050"]]

  def update
    if @todo.update(todo_params)
---
UPDATE "todos" SET "date" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["date", "0002-10-15"], ["updated_at", "2017-04-22 13:32:10.246823"], ["id", 1]]